In [1]:
import pandas as pd

In [2]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [3]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [4]:
s.values

array([9904312, 3448737, 2890451, 2466052], dtype=int64)

In [6]:
s.name="인구"

In [7]:
s.index.name="도시"

In [8]:
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [9]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object', name='도시')

In [12]:
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [13]:
s/100 #벡터화연산 =넘파이 배열과 동일

도시
서울    99043.12
부산    34487.37
인천    28904.51
대구    24660.52
Name: 인구, dtype: float64

In [14]:
s['부산']

3448737

In [15]:
s[0]

C:\Users\master\AppData\Local\Temp\ipykernel_28264\243613605.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[0]

9904312

In [16]:
s.iloc[0]

9904312

In [38]:
s.iloc[1:3]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [39]:
s[1:3]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [40]:
s['부산':'인천'] # 인덱싱 라벨로 줄때는 슬라이싱 뒤에도 포함 숫자 인덱스는 포함x

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [41]:
s.부산

3448737

In [42]:
s.인천

2890451

In [43]:
'부산' in s #s Series 안에 부산 라벨이 있느냐

True

In [44]:
for k,v in s.items():
    print(k)
    print(v)

서울
9904312
부산
3448737
인천
2890451
대구
2466052

In [ ]:
s.items()

In [47]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [48]:
s2 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158}) #python에 dict 가지고도 Series 생성 가능
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [51]:
s2 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158},
                  index=['대전','인천','서울','부산']) #이런식으로 라벨 순서를 정해줄 수 있음
s2

대전    1490158
인천    2632035
서울    9631482
부산    3393191
dtype: int64

In [54]:
s #2010년도 인구라 가정
s2 #2015년도 인구라 가정
ds=s-s2 #같은 라벨끼리는 뺄셈 연산이 시행되고 어느 한쪽만 자료가 존재하면 NaN(Not a Number)이 출력되고, 전체 결과 자료형 또한 float로 변환
ds #Series끼리 연산결과는 Series가 나오고 라벨은 겹치지 않는 라벨까지도 모두 들어감

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [55]:
s.notnull()

서울    True
부산    True
인천    True
대구    True
dtype: bool

In [56]:
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [57]:
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [64]:
ds=(s-s2)/s*100

In [66]:
ds=ds[ds.notnull()]
ds

부산    1.610619
서울    2.754659
인천    8.940335
dtype: float64

In [67]:
ds['부산']=1.63

In [68]:
ds

부산    1.630000
서울    2.754659
인천    8.940335
dtype: float64

In [71]:
del ds['서울']

In [72]:
ds

부산    1.630000
인천    8.940335
dtype: float64

In [73]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [74]:
obj.array

<NumpyExtensionArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [75]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [76]:
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [78]:
obj2['d']=6

In [79]:
obj2[obj2>0]

d    6
b    7
c    3
dtype: int64

In [84]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}

In [85]:
obj3=pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [86]:
dict(obj3)

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [87]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [88]:
pd.Series(sdata)

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [89]:
states = ["California", "Ohio", "Oregon", "Texas"]
obj4=pd.Series(sdata, index=states) # 인덱스 라벨이 무조건 먼저 Series에 들어가고 sdata에서 같은 라벨이 있다면 sdata에서 참조되서 들어감 california처럼 없다면 NaN값이 들어감
obj4  #요약해보면 우선순위로 따지면 index가 우선. index에지정된 순서와 지정된 데이터 값이 출력됨

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [91]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [92]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [93]:
obj4.notna()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [95]:
obj4[pd.notnull(obj4)]

Ohio      35000.0
Oregon    16000.0
Texas     71000.0
dtype: float64

In [96]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [97]:
obj4.name="population"
obj4.index.name="state"
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [99]:
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]

obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [100]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"], # 딕셔너리 안에 키값이 있고 데이터가 리스트로 들어가있음
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [101]:
pd.Series(data)

state    [Ohio, Ohio, Ohio, Nevada, Nevada, Nevada]
year           [2000, 2001, 2002, 2001, 2002, 2003]
pop                  [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
dtype: object

In [104]:
frame=pd.DataFrame(data) #딕셔너리 키 값이 데이터 프레임의 열 인덱스로 들어감 이후 리스트 순서대로 들어감 Series에는 행인덱스밖에 없지만 DataFrame에는 열인덱스와 행 인덱스가 있음.

In [105]:
# data2 = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
#         "year": [2000, 2001, 2002, 2001, 2002, 2003],
#         "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
# pd.DataFrame(data2)

In [106]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [107]:
frame.head() #맨 위에있는 데이터 5개
frame.tail() #맨 뒤에있는 데이터 5개 출력

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [108]:
pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [109]:
pd.DataFrame(data, columns=["year", "state", "pop", "debt"])

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [110]:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [111]:
frame2.index

RangeIndex(start=0, stop=6, step=1)

In [112]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [113]:
frame2['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [114]:
frame2.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [115]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [116]:
frame2.loc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [117]:
#iloc: 고유의 행 인덱스 번호를 지정하여 자료를 참조
#loc: 행 인덱스 라벨을 지정하여 자료를 참조
frame2 
#loc : frame2를 출력했을때 눈에 보이는 행 인덱스 라벨을 지정하여 자료를 참조
#iloc : frame2를 출력했을때 눈에 보이지 않는 고유의 인덱스번호(0~5번)를 행 인덱스 라벨이라고 하며 이것을 이용해 추출

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [118]:
frame2.iloc[-1] #고유의 번호라 뒤에서부터 첫번째 값 참조 가능

year       2003
state    Nevada
pop         3.2
debt        NaN
Name: 5, dtype: object

In [121]:
#frame2.loc[-1] #에러가 뜸 -1이라는 눈에 보이는 행 인덱스라벨이 없기때문

In [122]:
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [123]:
s.loc['서울']

9904312

In [124]:
#s.iloc['서울'] #이건 에러가 뜸 iloc는 고유의 '행 번호' 이기때문

In [125]:
frame2["debt"]

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
Name: debt, dtype: object

In [126]:
#데이터 프레임의 특정 행/열을 추출하면 시리즈가 나오게 됨.

In [127]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [128]:
frame2.debt=16.5

In [129]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [130]:
import numpy as np

In [131]:
frame2["debt"] = np.arange(6.)

In [132]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [133]:
val = pd.Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])

In [134]:
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [135]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [136]:
frame2["debt"] = val
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [137]:
frame2.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [139]:
frame2['easterm']=['True','True','True','False','False','False']

In [140]:
frame2

   year   state  pop  debt easterm
0  2000    Ohio  1.5   NaN    True
1  2001    Ohio  1.7   NaN    True
2  2002    Ohio  3.6   NaN    True
3  2001  Nevada  2.4   NaN   False
4  2002  Nevada  2.9   NaN   False
5  2003  Nevada  3.2   NaN   False

In [141]:
frame2["state"]=="Ohio"

0     True
1     True
2     True
3    False
4    False
5    False
Name: state, dtype: bool

In [142]:
frame2["eatern"]=frame2["state"]=="Ohio" # 데이터 프레임에 새로운 열을 추가하는법 많이쓰임

In [143]:
frame2

   year   state  pop  debt easterm  eatern
0  2000    Ohio  1.5   NaN    True    True
1  2001    Ohio  1.7   NaN    True    True
2  2002    Ohio  3.6   NaN    True    True
3  2001  Nevada  2.4   NaN   False   False
4  2002  Nevada  2.9   NaN   False   False
5  2003  Nevada  3.2   NaN   False   False

In [144]:
del frame2["easterm"]

In [145]:
frame2

   year   state  pop  debt  eatern
0  2000    Ohio  1.5   NaN    True
1  2001    Ohio  1.7   NaN    True
2  2002    Ohio  3.6   NaN    True
3  2001  Nevada  2.4   NaN   False
4  2002  Nevada  2.9   NaN   False
5  2003  Nevada  3.2   NaN   False

In [147]:
del frame2["eatern"]

In [148]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [151]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
               "Nevada": {2001: 2.4, 2002: 2.9 , 2003:3.1}} #키 값이 열 인덱스로 가고 벨류값에 있는 딕셔너리의 키값이 행 인덱스로 옴

In [152]:
pd.DataFrame(populations)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     3.1

In [153]:
frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     3.1

In [154]:
frame3.T # 전치행렬 : 행과 열을 바꿈

        2000  2001  2002  2003
Ohio     1.5   1.7   3.6   NaN
Nevada   NaN   2.4   2.9   3.1

In [155]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     3.1

In [156]:
pd.DataFrame(populations,index=[2001,2002])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [157]:
pd.DataFrame(populations,index=[2001,2002,2004])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2004   NaN     NaN

In [160]:
frame3[frame3.notnull()]

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     3.1

In [162]:
frame3['Ohio']

2000    1.5
2001    1.7
2002    3.6
2003    NaN
Name: Ohio, dtype: float64

In [164]:
frame3['Ohio'][[2000,2001]]

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [167]:
frame3['Ohio'].iloc[0:2]

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [168]:
frame3['Ohio'].head(2)

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [173]:
frame3['Nevada'][:2]

2000    NaN
2001    2.4
Name: Nevada, dtype: float64

In [174]:
frame3['Nevada'][:-2]

2000    NaN
2001    2.4
Name: Nevada, dtype: float64

In [175]:
pd.DataFrame({
    'Ohio':frame3['Ohio'][:2],
    'Nevada':frame3['Nevada'][:-2]
})

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [176]:
frame3.index.name="year"

In [177]:
frame3.columns.name="state"

In [178]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9
2003    NaN     3.1

In [179]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9],
       [nan, 3.1]])

In [180]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [181]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, nan],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [182]:
obj = pd.Series(np.arange(3), index=["a", "b", "c"])

In [183]:
obj.index

Index(['a', 'b', 'c'], dtype='object')

In [185]:
index=obj.index
index[1:]

Index(['b', 'c'], dtype='object')

In [187]:
pd.Series([1.5, -2.5, 0],index=np.arange(1,4))

1    1.5
2   -2.5
3    0.0
dtype: float64

In [188]:
'Utah' in frame3.columns

False

In [191]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [192]:
obj.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [195]:
obj2=obj.reindex(["a", "b", "c", "d", "e"])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [196]:
obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [199]:
obj3.reindex(np.arange(6),method='ffill')#결측값을 대체할때 방향을 forward(위->아래) fill

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [198]:
obj3.reindex(np.arange(6),method='bfill') #결측값을 대체할때 방향을 backward(아래->위) fill

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [200]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)), # 2차원 array
                     index=["a", "c", "d"],
                     columns=["Ohio", "Texas", "California"])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [201]:
frame2 = frame.reindex(index=["a", "b", "c", "d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [202]:
states = ["Texas", "Utah", "California"]

In [204]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [206]:
frame.loc[['a','d','c']]

   Ohio  Texas  California
a     0      1           2
d     6      7           8
c     3      4           5

In [208]:
frame.loc[['a','d','c'],'California']

a    2
d    8
c    5
Name: California, dtype: int32

In [210]:
frame.loc[['a','d','c'],['California','Texas']]

   California  Texas
a           2      1
d           8      7
c           5      4

In [211]:
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [212]:
new_obj=obj.drop('c')

In [213]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [214]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [218]:
obj.drop(["d", "c"])# 여러개 삭제시 리스트로도 가능. drop은 원본은 삭제되지않음

a    0.0
b    1.0
e    4.0
dtype: float64

In [219]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [220]:
data.drop(["Colorado", "Ohio"]) # 기본적으로 drop함수를 사용하면 행이 삭제됨.

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [222]:
data.drop(columns='two') #컬럼에서 two를 찾아서 드랍함
data.drop('two',axis=1) #axis를 1로 설정하면 열 인덱스로 지정됨

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [223]:
data.drop('two',axis='columns',inplace=True) #inplace 는 처음 False로 설정되어있음 True로 하면 드랍한 결과값을 반영을 하겠다는 의미

In [224]:
data

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [225]:
obj=pd.Series(np.arange(4.),index=['a','b','c','d'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [228]:
obj[1]
obj[2:4]
obj[[1,3]]

C:\Users\master\AppData\Local\Temp\ipykernel_28264\616152638.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[1]
C:\Users\master\AppData\Local\Temp\ipykernel_28264\616152638.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [229]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [230]:
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])
obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])

In [231]:
obj1

2    1
0    2
1    3
dtype: int64

In [232]:
obj2

a    1
b    2
c    3
dtype: int64

In [233]:
obj1.iloc[0:3]

2    1
0    2
1    3
dtype: int64

In [236]:
obj1.loc[[2,0,1]]

2    1
0    2
1    3
dtype: int64

In [237]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [238]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [239]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [241]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [242]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [243]:
data[data<5]

          one  two  three  four
Ohio      0.0  1.0    2.0   3.0
Colorado  4.0  NaN    NaN   NaN
Utah      NaN  NaN    NaN   NaN
New York  NaN  NaN    NaN   NaN

In [244]:
data[data<5]=0

In [245]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [263]:
data.loc['Colorado'].iloc[[1,2]]

two      5
three    6
Name: Colorado, dtype: int32

In [264]:
data[(data==5) | (data==6)]

          one  two  three  four
Ohio      NaN  NaN    NaN   NaN
Colorado  NaN  5.0    6.0   NaN
Utah      NaN  NaN    NaN   NaN
New York  NaN  NaN    NaN   NaN

In [266]:
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int32

In [267]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [284]:
data.iloc[[1,2],[3,0]]

          four  one
Colorado     7    0
Utah        11    8

In [281]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [269]:
data.iloc[[2,1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    0    5      6     7

In [273]:
data.iloc[2,[2,3]]

three    10
four     11
Name: Utah, dtype: int32

In [277]:
data.iloc[2,[1,3,2]]

two       9
four     11
three    10
Name: Utah, dtype: int32

In [285]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [293]:
data.loc['Ohio':'Utah']

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11

In [316]:
data.loc['Ohio']

one      0
two      0
three    0
four     0
Name: Ohio, dtype: int32

In [302]:
data.iloc[:,:3]

          one  two  three
Ohio        0    0      0
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [319]:
data[data.three>5]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [322]:

data.iloc[0:2,0:1]

          one
Ohio        0
Colorado    0

In [326]:
a=pd.Series([1,4,5,32],index=['가','나','다','라'])

In [327]:
b=pd.Series([5,3,25,6],index=['마','가','다','바'])

In [339]:
c=a-b

In [345]:
c[c.notnull()]

가    -2.0
다   -20.0
dtype: float64

In [372]:
dict={'제품':{2017: '가' ,2018 : '나' ,2019: '다'},'가격' :{2017:50000., 2018:100000., 2019: 10000.}, '수량':{2017:5,2019:50,2020:51,2021:55,2022:3}}

In [373]:
x=pd.DataFrame(dict)

In [374]:
x["재고"]=x['제품'].notnull()

In [375]:
x["주문가능"]=x["재고"]

In [376]:
x

       제품        가격    수량     재고   주문가능
2017    가   50000.0   5.0   True   True
2018    나  100000.0   NaN   True   True
2019    다   10000.0  50.0   True   True
2020  NaN       NaN  51.0  False  False
2021  NaN       NaN  55.0  False  False
2022  NaN       NaN   3.0  False  False

In [416]:

data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)

In [417]:
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [418]:
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [419]:
df.iloc[:,0:2]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [420]:
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [421]:
df.sum(axis=0)/3

국어     90.000000
영어     86.666667
수학    100.000000
dtype: float64

In [426]:
df['평균']=df.sum(axis=1)/3

In [428]:
df.iloc[3,1]=80

In [429]:
df

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  80  70  46.666667

In [439]:
df['평균']=(df.sum(axis=1))/3

In [440]:
df

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  80  70  60.000000

In [449]:
df.iloc[:1,:]

    국어  영어  수학         평균
춘향  80  90  90  86.666667

In [453]:
df.loc['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64